{
  "title": "Data Engineer",
  "link": "https://www.linkedin.com/jobs/view/3845444814/?trk=flagship3_search_srp_jobs",
  "company": "Energize Group",
  "description": "<span>\n                <p><!---->Our client is a start-up with a mission to mitigate the impact of clinician burnout and turnover in our nation’s health system. They are expanding our team and looking to hire the critical role of Data Engineer. The Data Engineer will work closely with the Chief Technology Officer, Chief Product Officer, and Chief Executive Officer to deliver actionable insights from data in a variety of situations.<!----></p><p><br></p><p><!---->Their mission is to improve the wellness of clinicians and their patients. They blend labor economics, machine learning, and clinical psychology. They are looking to contribute innovative and sustainable solutions to one of the most pressing problems in the healthcare industry. Building upon their proof-of-concept success, they have recently secured multiple engagements with nationwide healthcare organizations and have successfully raised institutional funding to expand their reach.<!----></p><p><br></p><p><!---->They are a small, close-knit team. This is an excellent opportunity for someone to join a mission-oriented, early-stage company at the ground floor and grow with them. There will be plenty of room for growth and creativity, and opportunities to tackle challenges that present one of the toughest problems in our society.<!----></p><p><br></p><p><strong><!---->Requirements<!----></strong></p>      <ul><li><!---->Strong hands-on experience of designing, developing and managing data pipelines<!----></li><li><!---->Strong coding skills in Python (required) and SQL (required)<!----></li><li><!---->Experience building and maintaining scalable data pipelines using AWS services, e.g. Athena, Glue, Redshift, RDS, S3, Data Pipeline, AppSync, and Lambda.<!----></li><li><!---->Thorough understanding and experience with task management tools<!----></li><li><!---->Knowledge of data management best practices for ETL, data governance, data warehousing, data modelling and data science<!----></li><li><!---->Basic knowledge of Linux (Redhat preferred) administration<!----></li><li><!---->Minimum B.S in Computer Science, software engineering or related field (or equivalent in related professional experience)<!----></li><li><!---->Strong communication skills<!----></li><li><!---->Strong problem-solving/critical thinking skills<!----></li><li><!---->Proven ability to work in a fast-paced, dynamic start-up environment<!----></li><li><!---->Hands-on knowledge of healthcare, health tech, or healthcare data analytics (preferred)<!----></li></ul>\n<p><br></p><p><strong><!---->Typical Tasks and Responsibilities include:<!----></strong></p>      <ul><li><!---->Working closely with CTO and data science team to build, manage and scale data pipelines for machine learning<!----></li><li><!---->Assisting the CTO &amp; CPO in managing and supporting analysis of enterprise data to drive better products and solutions<!----></li><li><!---->Managing company’s data infrastructure on AWS (Postgres/RDS, Athena, Redshift, S3, etc.)<!----></li><li><!---->Synthesizing multiple data sources, such as internal medical records and HR data<!----></li><li><!---->Integrating with client systems including EHR (Epic, Cerner), HRIS, flat files, etc.<!----></li><li><!---->Working closely with other key members on other projects<!----></li><li><!---->Developing and designing data security standards and policies in line with industry best practices.<!----></li></ul>\n\n<!---->            </span>"
}