{
  "title": "Data Engineer",
  "link": "https://www.linkedin.com/jobs/view/3835919904/?eBP=CwEAAAGOSaTVSbKeP_f1XPo0IJi0r5ZyaFl2fTMv2dTxMFdyAw7X8oPnCBGhkxhOnl2hW7ztaGORWlawvIaNhltn1k87KMCxXTPSxeRW70EQEddEouPISYQOBLw321qZ4IyaZko1FdsuVaIoQdM_EQnzx8xRERrUUcbucUNdonuQ3ooB3SKiDSubv0Py771b0bNfvsuOuip_vJ3zg0PBbexclgJJuAe126oN-bZjw1Y0oPSVVbFFYC0s1H_dlEwWENEA4zFc_Sav7T0Nwjxnaq7SuaOcxr0gbBd9nj6CBQQCOTGPr9L53tejUP80QnKjojCrTUvcYFoUqJow3RY05AR5CnyfGcFUEwdk7iUEfkSE6rx6z9eqbzqDtoKdz2G4S4N2Y9kvYDpkzewKOQ6sl5wvccInrZ8&refId=uqPsxXi%2FKOfsLKMXtiNbgA%3D%3D&trackingId=tltBoQctMfy81CfDYTH6WQ%3D%3D&trk=flagship3_search_srp_jobs",
  "company": "Morse.",
  "description": "<span>\n                <p><!---->Morse Data Enterprises is seeking an experienced Data Engineer to join our team. The successful candidate will be responsible for designing, developing, and maintaining our data warehouse and ETL pipelines, as well as ensuring the accuracy, consistency, and reliability of our data.<span class=\"white-space-pre\"> </span></p><p><span class=\"white-space-pre\"> </span><!----><!----></p><p><strong><!---->Responsibilities:<!----></strong><span class=\"white-space-pre\"> </span><!----><!----></p><p><span class=\"white-space-pre\"> </span><!----><!----></p>      <ul><li><!---->Design, develop, and maintain our data warehouse and ETL pipelines to ensure the accuracy, consistency, and reliability of our data.<span class=\"white-space-pre\"> </span></li><li><!---->Collaborate with other IT teams and stakeholders to understand their data needs and requirements.<span class=\"white-space-pre\"> </span></li><li><!---->Design and implement data models and schema for efficient storage and retrieval of data.<span class=\"white-space-pre\"> </span></li><li><!---->Develop and maintain ETL workflows using tools such as AWS Glue.<span class=\"white-space-pre\"> </span></li><li><!---->Monitor data quality and troubleshoot data-related issues, ensuring that data is complete, accurate, and consistent.<span class=\"white-space-pre\"> </span></li><li><!---->Optimize ETL workflows for performance, scalability, and maintainability.<span class=\"white-space-pre\"> </span></li><li><!---->Develop and maintain documentation for data models, ETL workflows, and data dictionaries.<span class=\"white-space-pre\"> </span></li><li><!---->Stay up-to-date with the latest data engineering technologies, trends, and best practices.<span class=\"white-space-pre\"> </span></li></ul>\n<p><span class=\"white-space-pre\"> </span><!----><!----></p><p><strong><!---->Qualifications:<!----></strong><span class=\"white-space-pre\"> </span><!----><!----></p><p><span class=\"white-space-pre\"> </span><!----><!----></p>      <ul><li><!---->Bachelor's degree in Computer Science, Information Technology, or related field; Master's degree preferred.<span class=\"white-space-pre\"> </span></li><li><!---->5+ years of experience in data engineering or related field, with a focus on ETL.<span class=\"white-space-pre\"> </span></li><li><!---->Strong experience with ETL tools such as Amazon Kinesis, AWS Glue, Amazon Redshift, AWS Data Pipeline, and AWS Lake Formation.<span class=\"white-space-pre\"> </span></li><li><!---->Strong SQL/NoSQL skills and experience with database technologies such as Amazon DynamoDB, MySQL, or PostgreSQL.<span class=\"white-space-pre\"> </span></li><li><!---->Experience with data modeling and schema design.<span class=\"white-space-pre\"> </span></li><li><!---->Strong problem-solving and analytical skills.<span class=\"white-space-pre\"> </span></li><li><!---->Excellent communication and interpersonal skills.<span class=\"white-space-pre\"> </span></li><li><!---->Ability to work independently and as part of a team.<span class=\"white-space-pre\"> </span></li><li><!---->Familiarity with Big Data technologies such as Hadoop, Spark, or Hive is a plus.<span class=\"white-space-pre\"> </span></li><li><!---->Experience with cloud-based data warehousing solutions such as Amazon Redshift, Google BigQuery, or Snowflake is a plus.<span class=\"white-space-pre\"> </span></li></ul>\n<p><br></p><p><!---->At Morse, our goal is to attract and retain top talent; we offer a competitive total compensation package that is directly influenced by your level of experience and qualifications, we believe that your skills and expertise should be rewarded accordingly.<!----></p><p><br></p><p><!---->In addition to a competitive base salary, our comprehensive compensation package includes:<!----></p><p><br></p>      <ul><li><!---->Performance-Based Bonuses: Your performance and experience will play a significant role in determining your annual bonus in addition to your base pay.<!----></li><li><!---->Equity: Experienced candidates may be eligible for equity, aligning your success with the company's growth.<!----></li><li><!---->Benefits Package: We provide a comprehensive benefits package that includes health, dental, and retirement plans, with options for customization based on your needs.<!----></li><li><!---->Professional Development: We invest in your continued growth and development through ongoing training and educational opportunities.<!----></li><li><!---->Additional Perks: As an experienced professional, you may also be eligible for additional perks such as flexible work arrangements, remote work options, and more.<!----></li></ul>\n<p><br></p><p><!---->Join our team and be part of an organization that values and compensates for experience appropriately. Your expertise will help drive our success, and we want to ensure you are fairly rewarded for your contributions.<!----></p><p><br></p><p><strong><!---->Applicants must currently be authorized to work in the United States without sponsorship. Morse Data Enterprises currently does not sponsor applicants for employment.<!----></strong></p>\n<!---->            </span>"
}